#pragma once

#ifndef CONFIG_H
#define CONFIG_H

#define _LCD_TYPE 1

// =====================================================
//                     GPIO
// =====================================================

// I2C
#define I2C_SDA 4//D2
#define I2C_SCL 5//D1

// DS18B20
#define DS18B20_PIN 14//D5

// DS1302 RTC
#define RTC_CLK 12//D6
#define RTC_DAT 13//D7
#define RTC_RST 15//D8

// Button
#define BUTTON_PIN 10//SD3


// =====================================================
//                  I2C ADDRESSES
// =====================================================

#define LCD_I2C_ADDR 0x27      // если не заработает, попробуй 0x3F
#define BME280_ADDR  0x76      // может быть 0x77


// =====================================================
//                    LCD
// =====================================================

#define LCD_COLUMNS 20
#define LCD_ROWS    4


// =====================================================
//                  SENSOR SETTINGS
// =====================================================

#define DS18B20_PRECISION 12   // 9..12 бит

// =====================================================
//                    TIMERS
// =====================================================

#define DISPLAY_UPDATE_MS 1000
#define SENSOR_UPDATE_MS  10000
#define DEBOUNCE_TIME     200

#define HORS_UPDATE_S    240
#define DAY_UPDATE_S     5400

// =====================================================
//                    SERIAL
// =====================================================

#define SERIAL_BAUD 115200

// =====================================================
//                    WIFI
// =====================================================

#define AP_SSID       "Aircore_lite"
#define AP_PASSWORD   ""
#define CONNECT_TIMEOUT 30000

// =====================================================
//                    METEO
// =====================================================

#define Latitude 56.088483
#define Longitude 54.247751

// =====================================================
//                    FW
// =====================================================

#define FW_VERSION "V0.15"

#endif